// унарні оператори

let x = 5;

x++;        // інкремент
-x;         // унарний мінус
!true;      // логічне заперечення
typeof x;   // тип змінної

//оператори бінарні

5 + 3;      // додавання
10 - 2;     // віднімання
4 * 2;      // множення
10 / 5;     // ділення

let a = 10; // оператор присвоєння
a > 5;      // порівняння
a == 10;    // рівність

//тернарний оператор

let age = 18;
let access = age >= 18 ? "можна піва" : "неможна піва";


// скрипт с контакт

let line1 = "Нехай завжди буде сонце, ";
let line2 = "Нехай завжди буде небо, ";
let line3 = "Нехай завжди буде мама, ";
let line4 = "Нехай завжди буду я.";

let poem = line1.concat(line2, line3, line4);

console.log(poem);
